БухЭксп/Catalogs/CW_НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_НастройкиПользователей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КлючОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеДоступа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПраваДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВладелецПраваДоступа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ГруппыПользователей</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндексКартинки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_НастройкиПользователей/Forms/ФормаУправленияНастройками/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("КлючОбъекта",КлючОбъекта);
	Параметры.Свойство("РежимОткрытия", РежимОткрытия);
	Параметры.Свойство("РежимВыбора", Элементы.ДеревоНастроек.РежимВыбора);
	
	Параметры.Свойство("СкрытьВозможностьОтбора", СкрытьВозможностьОтбора);
	
	ТекущийПользователь= CW_Настройки.Пользователь();
	// --- 
	
	Элементы.ДеревоНастроекКомандаВыбрать.КнопкаПоУмолчанию = Истина;
	Если (РежимОткрытия = "Сохранение") Тогда
		
		Заголовок = "Сохранение настроек";
		Элементы.ДеревоНастроек.ИзменятьСоставСтрок = Истина;
		Элементы.ФормаГруппаСоздание.Видимость = Истина;
		Элементы.ДеревоНастроекКомандаВыбрать.Заголовок = "Сохранить";
		Попытка
			Элементы.ДеревоНастроекКомандаВыбрать.Картинка=БиблиотекаКартинок.СохранитьФайл;	
		Исключение
		    Элементы.ДеревоНастроекКомандаВыбрать.Картинка=БиблиотекаКартинок.СохранитьФайл;
		КонецПопытки; 
		
		// --- 
		Элементы.ГруппаПараметры.Видимость = Ложь;
		// --- 
		Элементы.НеВосстанавливатьОтбор.Видимость = Ложь;
		
		Элементы.ДеревоНастроекДобавить.Видимость = Истина;
		Элементы.ДеревоНастроекКомандаДобавитьГруппу.Видимость = Истина;
		
	Иначе
		
		Заголовок = "Загрузка настроек";
		Элементы.ФормаГруппаСоздание.Видимость = Ложь;
		Элементы.ДеревоНастроек.ИзменятьСоставСтрок = Ложь;
		Элементы.ДеревоНастроекКомандаВыбрать.Заголовок = "Загрузить";
		Попытка
			Элементы.ДеревоНастроекКомандаВыбрать.Картинка=БиблиотекаКартинок.ЗагрузитьФайл;	
		Исключение
		    Элементы.ДеревоНастроекКомандаВыбрать.Картинка=БиблиотекаКартинок.ЗагрузкаФайла;
		КонецПопытки; 
		
		Элементы.ГруппаПараметры.Видимость = Ложь;
		Элементы.НеВосстанавливатьОтбор.Видимость = Не СкрытьВозможностьОтбора;
		
		Если (Параметры.Свойство("ИмяФормыВладельца")) Тогда
			
			УФ = Новый Структура("ИмяФормы",Параметры.ИмяФормыВладельца);
			Если (CW_Журналы_Сервер.ЭтоФормаЗаказа(УФ) ИЛИ CW_Журналы_Сервер.ЭтоФормаЗаявки(УФ)) Тогда
				НеВосстанавливатьОтбор = Истина;
				Элементы.НеВосстанавливатьОтбор.Доступность=Ложь;
			КонецЕсли;  
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	_СформироватьДерево();
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура СформироватьДерево()
	// --- 
	
	СохранитьВидДерева();
	_СформироватьДерево();
	ВосстановитьВидДерева();
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВидДерева()
	// --- 
	
	СостояниеДерева.Очистить();
	// --- 
	КореньДерева = Неопределено;
	СтрокиДерева = ДеревоНастроек.ПолучитьЭлементы();
	Если (СтрокиДерева.Количество() <> 0) Тогда
		ОпределитьСтатусУзла(СтрокиДерева[0]);
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Функция ОпределитьСтатусУзла(Узел)
	// --- 
	
	Если (Узел.ЭтоГруппа) Тогда
		
		СостояниеДерева.Добавить(Узел.Ссылка,,Элементы.ДеревоНастроек.Развернут(Узел.ПолучитьИдентификатор()));
		// --- 
		Для каждого ПУ Из Узел.ПолучитьЭлементы() Цикл
			
			ОпределитьСтатусУзла(ПУ);
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ВосстановитьВидДерева()
	// --- 
	
	ИдентификаторТекущегоУзла = 0;
	
	Если (СостояниеДерева.Количество() <> 0) Тогда
		
		СтрокиДерева = ДеревоНастроек.ПолучитьЭлементы();
		ТекущаяСтрокаВосстановлена = Ложь;
		Если (СтрокиДерева.Количество() <> 0) Тогда
			
			Для каждого СтрокаДерева Из СтрокиДерева Цикл
				ВосстановитьСтатусУзла(СтрокаДерева);	
				Если (НЕ ТекущаяСтрокаВосстановлена) Тогда
					Если (ИдентификаторТекущегоУзла <> 0) Тогда
						Элементы.ДеревоНастроек.ТекущаяСтрока = ИдентификаторТекущегоУзла;	
						ТекущаяСтрокаВосстановлена=Истина;
					КонецЕсли; 	
				КонецЕсли; 
				
			КонецЦикла; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Функция ВосстановитьСтатусУзла(Узел)
	// --- 
	
	СсылкаУзла = Узел.Ссылка;
	ТекущийИдентификатор = Узел.ПолучитьИдентификатор();
	// --- 
	Если (Узел.ЭтоГруппа) Тогда
		
		
		ЗаписьСтатуса = СостояниеДерева.НайтиПоЗначению(СсылкаУзла);
		Если (ЗаписьСтатуса <> Неопределено) Тогда
			
			Если (ЗаписьСтатуса.Пометка) Тогда
				
				Элементы.ДеревоНастроек.Развернуть(ТекущийИдентификатор);
				
			КонецЕсли; 
			
			Если (СсылкаУзла = ТекущийРодительУзла ИЛИ СсылкаУзла = ТекущийУзел) Тогда
				
				ИдентификаторТекущегоУзла = ТекущийИдентификатор;
				
			КонецЕсли; 
			
		Иначе
			
			Элементы.ДеревоНастроек.Развернуть(Узел.ПолучитьИдентификатор());
			
		КонецЕсли; 
		
		Для каждого ПУ Из Узел.ПолучитьЭлементы() Цикл
			
			ВосстановитьСтатусУзла(ПУ);
			
		КонецЦикла; 
		
	Иначе
		
		Если (СсылкаУзла = ТекущийУзел) Тогда
			
			ИдентификаторТекущегоУзла = ТекущийИдентификатор;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецФункции

// --- 

&НаСервере
Функция _ОпределитьУровеньГруппы(Группа, СоответствиеУровней)
	// --- 
	
	Если (Группа.Родитель.Пустая()) Тогда
		
		УровеньРодителя = 0;
		
	Иначе
		
		УровеньРодителя = СоответствиеУровней.Получить(Группа.Родитель);
		Если (УровеньРодителя = Неопределено) Тогда
			УровеньРодителя = _ОпределитьУровеньГруппы(Группа.Родитель, СоответствиеУровней);
		КонецЕсли; 
		
	КонецЕсли; 
	// --- 
	Возврат(1+УровеньРодителя);
	
	// --- 
КонецФункции
 
&НаСервере
Процедура _СформироватьВеткуДерева(СтрокаТЗ, ТЗ, Родитель=Неопределено)
	// --- 
	
	Если (СтрокаТЗ.СтрокаСформирована) Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Если (Родитель = Неопределено) Тогда
		
		Нстр = ДеревоНастроек.ПолучитьЭлементы().Добавить();
		
	Иначе
		
		Нстр = Родитель.ПолучитьЭлементы().Добавить();
		Нстр.ТолькоПросмотр = Родитель.ТолькоПросмотр;
		
	КонецЕсли; 
	
	Нстр.Ссылка 	= СтрокаТЗ.Ссылка;
	Нстр.ЭтоГруппа 	= СтрокаТЗ.ЭтоГруппа;
	Нстр.Автор 		= СтрокаТЗ.Автор;
	СтрокаТЗ.СтрокаСформирована = Истина;
	Если (СтрокаТЗ.ЭтоГруппа) Тогда
		
		Нстр.ИндексКартинки = 0;
		Нстр.Описание = СтрокаТЗ.Описание;
		// --- 
		Отбор = Новый Структура("Родитель",Нстр.Ссылка);
		ТаблицаПодчиненных = _сф.к_НайтиСтроки(ТЗ,Отбор);
		Для каждого СтрокаПодчиненного Из ТаблицаПодчиненных Цикл
			_СформироватьВеткуДерева(СтрокаПодчиненного, ТЗ, Нстр);
		КонецЦикла; 
		// --- 
		//КоличествоПодчиненных = ТаблицаПодчиненных.Количество();
		//ПредставлениеКоличества = ?(КоличествоПодчиненных <> 0," ("+Формат(КоличествоПодчиненных)+")",""); 
		//Нстр.Представление = СтрокаТЗ.Наименование + ПредставлениеКоличества;
		Нстр.Представление = СтрокаТЗ.Наименование;
		
	Иначе
		
		Нстр.ИндексКартинки = 1;
		// --- 
		Нстр.Представление = СтрокаТЗ.Наименование;
		Нстр.Описание = СтрокаТЗ.Описание;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

// --- 

&НаСервере
Процедура _СформироватьДерево()
	// --- 
	
	// очищаем дерево
	ДеревоНастроек.ПолучитьЭлементы().Очистить();
	// ---------------------------------------------------------------------------- 
	
	#Область ЛичныеНастройки 
	
	Нстр = ДеревоНастроек.ПолучитьЭлементы().Добавить();
	Нстр.Ссылка = Справочники.CW_НастройкиПользователей.ПустаяСсылка();
	Нстр.ЭтоГруппа = Истина;
	Нстр.Представление = "Личные";
	Нстр.Описание = "Личные настройки";
	// --- 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_НастройкиПользователей.Ссылка КАК Ссылка,
	               |	CW_НастройкиПользователей.Родитель КАК Родитель,
	               |	CW_НастройкиПользователей.Наименование КАК Наименование,
	               |	0 КАК Уровень,
	               |	CW_НастройкиПользователей.ЭтоГруппа КАК ЭтоГруппа,
	               |	CW_НастройкиПользователей.Описание КАК Описание,
	               |	ЛОЖЬ КАК СтрокаСформирована,
	               |	CW_НастройкиПользователей.Пользователь КАК Автор
	               |ИЗ
	               |	Справочник.CW_НастройкиПользователей КАК CW_НастройкиПользователей
	               |ГДЕ
	               |	CW_НастройкиПользователей.Пользователь = &Пользователь
	               |	И CW_НастройкиПользователей.КлючОбъекта = &КлючОбъекта
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Наименование
	               |АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("Пользователь", ТекущийПользователь);
	Запрос.УстановитьПараметр("КлючОбъекта", КлючОбъекта); 
	// --- 
	ТЗ_ЛичныеНастройки = Запрос.Выполнить().Выгрузить();
	
	УровниГрупп = Новый Соответствие;
	Для каждого Стр Из ТЗ_ЛичныеНастройки Цикл
		
		Если (Стр.ЭтоГруппа) Тогда
			
			УровниГрупп.Вставить(Стр.Ссылка,_ОпределитьУровеньГруппы(Стр.Ссылка,УровниГрупп));
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	ТЗ_ЛичныеНастройки.Сортировать("ЭтоГруппа Убыв,Уровень Убыв");
	// --- 
	Для каждого Стр Из ТЗ_ЛичныеНастройки Цикл
		
		_СформироватьВеткуДерева(Стр, ТЗ_ЛичныеНастройки, Нстр);
		
	КонецЦикла; 
	
	#КонецОбласти 
	
	#Область ОбщиеНастройки
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_НастройкиПользователей.Ссылка КАК Ссылка,
	               |	CW_НастройкиПользователей.Родитель КАК Родитель,
	               |	CW_НастройкиПользователей.Наименование КАК Наименование,
	               |	0 КАК Уровень,
	               |	CW_НастройкиПользователей.ЭтоГруппа КАК ЭтоГруппа,
	               |	CW_НастройкиПользователей.Описание КАК Описание,
	               |	ЛОЖЬ КАК СтрокаСформирована,
	               |	CW_НастройкиПользователей.ОграничениеДоступа КАК ОграничениеДоступа,
	               |	CW_НастройкиПользователей.Пользователь КАК Автор
	               |ИЗ
	               |	Справочник.CW_НастройкиПользователей КАК CW_НастройкиПользователей
	               |ГДЕ
	               |	CW_НастройкиПользователей.Пользователь <> &Пользователь
	               |	И CW_НастройкиПользователей.ОбщаяНастройка = ИСТИНА
	               |	И CW_НастройкиПользователей.ЭтоГруппа = ЛОЖЬ
	               |	И CW_НастройкиПользователей.КлючОбъекта = &КлючОбъекта";
	Запрос.УстановитьПараметр("Пользователь", ТекущийПользователь);
	Запрос.УстановитьПараметр("КлючОбъекта", КлючОбъекта);
	ТЗ_ОбщиеНастройки = Запрос.Выполнить().Выгрузить();
	// --- 
	МассивУдаляемых = Новый Массив;
	Для каждого Стр Из ТЗ_ОбщиеНастройки Цикл
		
		Если (Стр.ОграничениеДоступа) Тогда
			
			// проверяем 
			ДоступноПользователю = Стр.Ссылка.ПраваДоступа.Найти(ТекущийПользователь,"ВладелецПраваДоступа");
			Если (ДоступноПользователю = Неопределено) Тогда
				
				// проверяем группу
				ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(ТекущийПользователь);
				ДоступноПользователю = Стр.Ссылка.ПраваДоступа.Найти(ГруппаПользователя,"ВладелецПраваДоступа");
				
			КонецЕсли; 
			Если (ДоступноПользователю = Неопределено) Тогда
				
				МассивУдаляемых.Добавить(Стр);
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	_сф.к_УдалитьЭлементыПоМассиву(ТЗ_ОбщиеНастройки,МассивУдаляемых);
	
	// --- 
	
	Нстр = ДеревоНастроек.ПолучитьЭлементы().Добавить();
	Нстр.Ссылка = Справочники.CW_НастройкиПользователей.ПустаяСсылка();
	Нстр.ЭтоГруппа = Истина;
	Нстр.Представление = "Общие";
	Нстр.Описание = "Настройки других пользователей в общем доступе";
	Нстр.ИндексКартинки = 2;
	Нстр.ТолькоПросмотр = Истина;
	
	// --- 
	Для каждого Стр Из ТЗ_ОбщиеНастройки Цикл
		
		_СформироватьВеткуДерева(Стр, ТЗ_ОбщиеНастройки, Нстр);
		
	КонецЦикла; 
	
	#КонецОбласти 
	
	// --- 
КонецПроцедуры

// --- 

&НаКлиенте
Процедура ДеревоНастроекВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если (НЕ Элементы.ДеревоНастроек.ТекущиеДанные.ЭтоГруппа) Тогда
		
		Если (РежимОткрытия = "Сохранение") Тогда
			
			СтандартнаяОбработка = ложь;
			
			Режим = РежимДиалогаВопрос.ДаНет;
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОСохраненииНастройкиВыбор", ЭтаФорма, Параметры);
			ПоказатьВопрос(Оповещение,"Сохраненная настройка будет заменена текущей. Продолжить?" , Режим, 0); 
			
			
		Иначе
			
			ВернутьЗначениеЗагрузки(Элементы.ДеревоНастроек.ТекущиеДанные.Ссылка);
			
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОСохраненииНастройкиВыбор(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ЭтаФорма.Закрыть(Неопределено);
		Возврат;
	КонецЕсли;
	
	Если (НЕ Элементы.ДеревоНастроек.ТекущиеДанные.ТолькоПросмотр) Тогда
		ВернутьЗначениеСохранения(Элементы.ДеревоНастроек.ТекущиеДанные.Ссылка);
	Иначе
		_УФК.ВывестиПредупреждение("Изменение общих настроек запрещено.");
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаВыбрать(Команда)
	
	Если (Элементы.ДеревоНастроек.ТекущиеДанные.Ссылка <> Неопределено) Тогда
		
		Если (НЕ Элементы.ДеревоНастроек.ТекущиеДанные.ЭтоГруппа) Тогда
			
			Если (РежимОткрытия = "Сохранение") Тогда
				
				Режим = РежимДиалогаВопрос.ДаНет;
				Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОСохраненииНастройки", ЭтаФорма, Параметры);
				ПоказатьВопрос(Оповещение,"Сохраненная настройка будет заменена текущей. Продолжить?" , Режим, 0); 
					
			Иначе
				
				ВернутьЗначениеЗагрузки(Элементы.ДеревоНастроек.ТекущиеДанные.Ссылка);
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗакрытияВопросаОСохраненииНастройки(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		
		ЭтаФорма.Закрыть(Неопределено);
		
		Возврат;
	КонецЕсли;
	
	Если (НЕ Элементы.ДеревоНастроек.ТекущиеДанные.ТолькоПросмотр) ИЛИ ЭтоПолноправныйПользователь() Тогда
		ВернутьЗначениеСохранения(Элементы.ДеревоНастроек.ТекущиеДанные.Ссылка);
	Иначе
		_УФК.ВывестиПредупреждение("Изменение общих настроек запрещено.");
	КонецЕсли; 
	
	
КонецПроцедуры



&НаКлиенте
Функция ВернутьЗначениеСохранения(Значение)
	// --- 
	
	ЭтаФорма.Закрыть(Значение);
	
	// --- 
КонецФункции

&НаКлиенте
Функция ВернутьЗначениеЗагрузки(Значение)
	// --- 
	
	Ответ = Новый Структура("НастройкаСсылка,НеВосстанавливатьОтбор",Значение,НеВосстанавливатьОтбор);
	ЭтаФорма.Закрыть(Ответ);
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КомандаДобавитьГруппу(Команда)
	
	Если (Элементы.ДеревоНастроек.ТекущиеДанные <> Неопределено) Тогда
		
		Если (Элементы.ДеревоНастроек.ТекущиеДанные.ЭтоГруппа) Тогда
			
			Родитель = Элементы.ДеревоНастроек.ТекущиеДанные.Ссылка;
			
		Иначе
			
			Родитель = Неопределено;
			
		КонецЕсли; 
		
	Иначе
		
		Родитель = Неопределено;
		
	КонецЕсли; 
	
	ПФ = Новый Структура("ЗначенияЗаполнения,ЭтоГруппа,Родитель",Новый Структура("Пользователь,Родитель,КлючОбъекта",ТекущийПользователь,Родитель,КлючОбъекта),Истина,Родитель);
	ОткрытьФорму("Справочник.CW_НастройкиПользователей.ФормаГруппы",ПФ,Элементы.ДеревоНастроек);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	// --- 
	
	Если (Элементы.ДеревоНастроек.ТекущиеДанные <> Неопределено) Тогда
		
		Если (Элементы.ДеревоНастроек.ТекущиеДанные.ЭтоГруппа) Тогда
			
			Родитель = Элементы.ДеревоНастроек.ТекущиеДанные.Ссылка;
			
		Иначе
			
			Родитель = Неопределено;
			
		КонецЕсли; 
		
	Иначе
		
		Родитель = Неопределено;
		
	КонецЕсли; 
	
	ПФ = Новый Структура("ЗначенияЗаполнения,ЭтоГруппа,Родитель",Новый Структура("Пользователь,Родитель,КлючОбъекта",ТекущийПользователь,Родитель,КлючОбъекта),Ложь,Родитель);
	//ПОВ = Новый ОписаниеОповещения("ОбработкаСозданияНастройки",ЭтотОбъект, Новый Структура()); 
	ОткрытьФорму("Справочник.CW_НастройкиПользователей.Форма.ФормаЭлемента",ПФ, Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСозданияНастройки(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	//Если (Ответ <> Неопределено) Тогда
	//	
	//	Если (РежимОткрытия = "Сохранение") Тогда
	//		
	//		ВернутьЗначениеСохранения(Ответ);
	//		
	//	КонецЕсли; 
	//	
	//КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Процедура ДеревоНастроекОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	ТекущийУзел = НовыйОбъект;
	// --- 
	СформироватьДерево();
	// --- 
	Если (РежимОткрытия = "Сохранение") Тогда
		
		Если (НЕ _ЭтоГруппа(НовыйОбъект)) Тогда
			ВернутьЗначениеСохранения(НовыйОбъект);	
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция _ЭтоГруппа(НастройкаСсылка)
	// --- 
	
	Возврат(НастройкаСсылка.ЭтоГруппа);
	
	// --- 
КонецФункции
 

&НаКлиенте
Процедура ДеревоНастроекПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	// --- 
	// открываем форму редактирования
	Если (Элементы.ДеревоНастроек.ТекущиеДанные <> Неопределено) Тогда
		
		Если (Элементы.ДеревоНастроек.ТекущиеДанные.Ссылка.Пустая()) Тогда
			
			// это корень
			Возврат;
			
		КонецЕсли; 
		
		ПФ = Новый Структура("Ключ",Элементы.ДеревоНастроек.ТекущиеДанные.Ссылка);
		Если (НЕ Элементы.ДеревоНастроек.ТекущиеДанные.ЭтоГруппа) Тогда
			
			ОткрытьФорму("Справочник.CW_НастройкиПользователей.Форма.ФормаЭлемента",ПФ,Элемент);
			
		Иначе
			
			ОткрытьФорму("Справочник.CW_НастройкиПользователей.Форма.ФормаГруппы",ПФ,Элемент);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекПриАктивизацииСтроки(Элемент)
	
	ТекущийУзел = Элементы.ДеревоНастроек.ТекущиеДанные.Ссылка;
	СтрокаРодителя = Элементы.ДеревоНастроек.ТекущиеДанные.ПолучитьРодителя();
	Если (СтрокаРодителя <> Неопределено) Тогда
		ТекущийРодительУзла = СтрокаРодителя.Ссылка;
	Иначе
		ТекущийРодительУзла = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиОписание()
	// --- 
	
	Если (Элементы.ДеревоНастроек.ТекущаяСтрока <> Неопределено) Тогда
		_ВывестиОписание(Элементы.ДеревоНастроек.ТекущаяСтрока);	
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаСервере
Процедура _ВывестиОписание(Идентификатор)
	// --- 
	
	//Если (ТекущийИдентификатор = 0) Тогда
	//	
	//КонецЕсли; 
	ТДД = ДеревоНастроек.НайтиПоИдентификатору(Идентификатор);
	Если (ТДД.Ссылка.Пустая()) Тогда
		
		// это служебные элементы
		Если (ТДД.Представление = "Личные") Тогда
			
			ОписаниеТекущегоОбъекта = "Личные настройки";
			
		Иначе
			
			ОписаниеТекущегоОбъекта = "Настройки других пользователей в общем доступе";
			
		КонецЕсли; 
		
	Иначе
		
		ОписаниеТекущегоОбъекта = ТДД.Ссылка.Описание;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	СформироватьДерево();
	
КонецПроцедуры



&НаКлиенте
Процедура ДеревоНастроекПередУдалением(Элемент, Отказ)
	
	Если (Элементы.ДеревоНастроек.ТекущиеДанные <> Неопределено) Тогда
		
		Отказ = Истина;
		ТребуетсяПодтверждение = Ложь;
		Если (Элементы.ДеревоНастроек.ТекущиеДанные.ЭтоГруппа) Тогда
			
			Если (Элементы.ДеревоНастроек.ТекущиеДанные.Ссылка = ПредопределенноеЗначение("Справочник.CW_НастройкиПользователей.ПустаяСсылка")) Тогда
				
				Отказ = Истина;
				_УФК.ВывестиПредупреждение("Корневую группу нельзя удалить");
				Возврат;
				
			КонецЕсли; 
			
			Если (Элементы.ДеревоНастроек.ТекущиеДанные.ПолучитьЭлементы().Количество() <> 0) Тогда
				
				ТребуетсяПодтверждение = Истина;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если (Элементы.ДеревоНастроек.ТекущиеДанные.ТолькоПросмотр) Тогда
			
			Если Не ЭтоПолноправныйПользователь() Тогда 
				Отказ = Истина;
				_УФК.ВывестиПредупреждение("Общую настройку нельзя удалить.");
				Возврат;
			КонецЕсли;   
			
		КонецЕсли;  
		
		ТекстВопроса = "";
		Если Элементы.ДеревоНастроек.ТекущиеДанные.ТолькоПросмотр Тогда
			ТекстВопроса = "Настройка является общей. Внесение в настройку изменений повлияет на работу других пользователей. ";
		КонецЕсли;
		
	
		// подтверждение в случае удаления группы настроек
		Если (ТребуетсяПодтверждение) Тогда
			
			ТекстВопроса = ТекстВопроса + "Удалить группу настроек?";
			
			ПОВ = Новый ОписаниеОповещения("ВыполнитьУдалениеФайла",ЭтотОбъект, Новый Структура());
			ПоказатьВопрос(ПОВ,ТекстВопроса,РежимДиалогаВопрос.ДаНет);
			
			
			// при удаления выбранной настройки, лишний раз убеждаемся в том, 
			// что действие пользователя осознанное
		Иначе
			
			ТекстВопроса = ТекстВопроса + "Подтвердите удаление настройки (отменить удаление будет невозможно)?";
	
			ПОВ = Новый ОписаниеОповещения("ВыполнитьУдалениеФайла",ЭтотОбъект, Новый Структура());
			ПоказатьВопрос(ПОВ, ТекстВопроса,РежимДиалогаВопрос.ДаНет);
			
			//	ВыполнитьУдалениеФайла(КодВозвратаДиалога.Да,Неопределено);
			
		КонецЕсли;   
		
	КонецЕсли; 
	
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ЭтоПолноправныйПользователь()
	Возврат Пользователи.ЭтоПолноправныйПользователь(, Истина)
КонецФункции

&НаКлиенте
Процедура УдалитьФайл(Команда)
	
	Если (Элементы.ДеревоНастроек.ТекущиеДанные <> Неопределено) Тогда
		
		ТребуетсяПодтверждение = Ложь;
		Если (Элементы.ДеревоНастроек.ТекущиеДанные.ЭтоГруппа) Тогда
			
			Если (Элементы.ДеревоНастроек.ТекущиеДанные.ПолучитьЭлементы().Количество() <> 0) Тогда
				
				ТребуетсяПодтверждение = Истина;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если (ТребуетсяПодтверждение) Тогда
			
			ПОВ = Новый ОписаниеОповещения("ВыполнитьУдалениеФайла",ЭтотОбъект, Новый Структура());
			ПоказатьВопрос(ПОВ,"Удалить группу файлов?",РежимДиалогаВопрос.ДаНет);
			
		Иначе
			
			ВыполнитьУдалениеФайла(КодВозвратаДиалога.Да,Неопределено);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьУдалениеФайла(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ = КодВозвратаДиалога.Да) Тогда
		
		РезультатУдаления = _УдалитьФайл(Элементы.ДеревоНастроек.ТекущиеДанные.Ссылка);
		Если (_УФКС.ВыполненоУспешно(РезультатУдаления)) Тогда
			ТекущийУзел = Неопределено;
			ТекущийИдентификатор = 0;
			СформироватьДерево();
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  
 
&НаСервере
Функция _УдалитьФайл(Ссылка)
	// --- 
	
	Попытка
		
		Если (Ссылка.ЭтоГруппа) Тогда
			
			// получаем подчиненные и удаляем
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	CW_НастройкиПользователей.Ссылка
			               |ИЗ
			               |	Справочник.CW_НастройкиПользователей КАК CW_НастройкиПользователей
			               |ГДЕ
			               |	CW_НастройкиПользователей.Родитель = &Родитель";
			Запрос.УстановитьПараметр("Родитель", Ссылка);
			ТЗ = Запрос.Выполнить().Выгрузить();
			// --- 
			Для каждого Стр Из ТЗ Цикл
				
				Ответ = _УдалитьФайл(Стр.Ссылка);
				Если (НЕ _УФКС.ВыполненоУспешно(Ответ)) Тогда
					
					Сообщить(_УФКС.ПредставлениеОшибки(Ответ));
					Возврат(Ответ);
					
				КонецЕсли; 
				
			КонецЦикла; 
			
		КонецЕсли; 
		
		УстановитьПривилегированныйРежим(Истина);
		Об = Ссылка.ПолучитьОбъект();
		Об.Удалить();
		
	Исключение
		
		Сообщить(ОписаниеОшибки());
		Возврат(_УФКС.Ответ(1));
		
	КонецПопытки; 
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

// --- 

&НаКлиенте
Процедура ДеревоНастроекПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	// --- 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ПараметрыПеретаскивания = Неопределено;
	// --- 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка=Ложь;
	
	// проверяем что и куда мы перетащили
	Если (ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Число")) Тогда
		
		СтрокаЧто = ДеревоНастроек.НайтиПоИдентификатору(ПараметрыПеретаскивания.Значение);
		СтрокаКуда = ДеревоНастроек.НайтиПоИдентификатору(Строка);
		
		Если (СтрокаЧто.ТолькоПросмотр ИЛИ СтрокаКуда.ТолькоПросмотр) Тогда
			
			Возврат;
			
		КонецЕсли; 
		
		_УстановитьРодителя(ПараметрыПеретаскивания.Значение,Строка);
		СформироватьДерево();
		
	КонецЕсли; 
		
КонецПроцедуры

&НаСервере
Процедура _УстановитьРодителя(ИдентификаторЭлемента, ИдентификаторГруппы)
	// --- 
	
	СтрокаЭлемента = ДеревоНастроек.НайтиПоИдентификатору(ИдентификаторЭлемента);
	СтрокаГруппы = ДеревоНастроек.НайтиПоИдентификатору(ИдентификаторГруппы);
	
	Если (СтрокаГруппы.ЭтоГруппа) Тогда
		
		ЭлементАрхива = СтрокаЭлемента.Ссылка.ПолучитьОбъект();
		ЭлементАрхива.Родитель = СтрокаГруппы.Ссылка;
		ЭлементАрхива.Записать();
		
		ТекущийРодительУзла = ЭлементАрхива.Родитель;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КомандаДополнительно(Команда)
	
	Элементы.ГруппаПараметры.Видимость = Истина;
	
КонецПроцедуры

// Необходимость добавления отдельной команды удаления связана с тем,
// что в режиме выбора система автоматически блокирует кнопку.
// Для обхода такого повидения "пробросим" вызова обработчика через отдельную команду.
&НаКлиенте
Процедура КомандаУдалить(Команда)
	ДеревоНастроекПередУдалением(Элементы.ДеревоНастроекУдалитьНепосредственно, Истина);
КонецПроцедуры
